VGH/src/Documents/РеестрОтгрузок/РеестрОтгрузок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрОтгрузок</name>
  <posting>Deny</posting>
  <attributes>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

VGH/src/Documents/РеестрОтгрузок/ManagerModule.bsl
Процедура СохранитьРеестр(СтруктураРеестр) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрОтгрузок.Ссылка
		|ИЗ
		|	Документ.РеестрОтгрузок КАК РеестрОтгрузок
		|ГДЕ
		|	РеестрОтгрузок.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", СтруктураРеестр.reestr_number);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		ОбъектДокумента = СоздатьДокумент();
		ОбъектДокумента.ВнешняяСсылка = СтруктураРеестр.reestr_ref;
		ОбъектДокумента.Дата = Дата(СтруктураРеестр.reestr_date);
		ОбъектДокумента.Номер = СтруктураРеестр.reestr_number;
		
	КонецЕсли;
	
	ОбъектДокумента.Напечатан = СтруктураРеестр.reestr_printing;
	ОбъектДокумента.Записать();

КонецПроцедуры
